[
  {
    "company": "Wabox",
    "position": "Desarrollador Fullstack",
    "task": "Me desempeñé como desarrollador fullstack participando en el diseño, construcción y mantenimiento de software interno. Junto con mi equipo trabajamos en el desarrollo de interfaces utilizando HTML, CSS, Tailwind, JavaScript, TypeScript y Frameworks de js, aplicando buenas prácticas y asegurando un rendimiento óptimo. En el backend participe en el desarrollo de servicios y microservicios con Node.js y Express, así como en la implementación de APIs RESTful con Java y Spring Boot. Contribuí a la integración de sistemas externos, optimización de endpoints, mejora de tiempos de respuesta y documentación técnica. Metodologías ágiles (scrum | kanban).",
    "stack": [
      "HTML5",
      "CSS3",
      "TailwindCSS",
      "JavaScript",
      "TypeScript",
      "React.js",
      "React router",
      "Axios",
      "Angular 17",
      "Node.js",
      "Express.js",
      "MySQL",
      "ORM Sequelize",
      "MVC",
      "API RESTful",
      "Pruebas cruzadas",
      "Postman - Insomnia",
      "Git",
      "GitHub",
      "GitFlow",
      "AWS - CodeCommit",
      "Metodologías ágiles (Scrum | Kanban)"
    ]
  },
  {
    "company": "Weblabor MX",
    "position": "Desarrollador Frontend | Fullstack",
    "task": "Formé parte del equipo de desarrollo de Weblabor MX como fullstack orientado al frontend. Construí interfaces interactivas usando TALL Stack (Tailwind, Alpine, Livewire y Laravel) y Vue 3, integrando componentes y servicios de terceros. También participe en el desarrollo de APIs RESTful internas con PHP, Laravel y MySQL, además de realizar mantenimiento, mejoras funcionales y soporte continuo. Trabajé bajo metodologías ágiles. (kanban).",
    "stack": [
      "HTML5",
      "CSS3",
      "TailwindCSS",
      "JavaScript",
      "TypeScript",
      "Inertia",
      "Vue.js",
      "Alpine.js",
      "PHP",
      "Laravel",
      "Livewire",
      "Figma",
      "MySQL",
      "API RESTful",
      "MVC",
      "Pruebas cruzadas",
      "Postman - Insomnia",
      "Git",
      "GitHub",
      "GitFlow",
      "AWS - CodeCommit",
      "Figma",
      "Metodologías ágiles (Kanban)"
    ]
  },
  {
    "company": "CTeam",
    "position": "Desarrollador y Diseñador web",
    "task": "Estuve acargo del diseño, desarrollo y mantenimiento de sitios web, optimizando rendimiento, hosting y SSL. Personalización de plantillas y templates. Diseño web - diseño multimedia.",
    "stack": [
      "HTML5",
      "CSS3",
      "BootStrap",
      "JavaScript",
      "PHP",
      "phpMyAdmin",
      "Git",
      "GitHub",
      "WordPress",
      "Elementor",
      "Figma",
      "Photoshop",
      "Illustrator",
      "Metodologías ágiles (Kanban)"
    ]
  },
  {
    "company": "PC Ryzer's",
    "position": "Soporte técnico",
    "task": "Di soporte técnico de forma remota y on site a distintos clientes, me encargaba de tareas como solucionar incidencias técnicas, soporte para software como antivirus, instalaciones, diagnóstico y demás.",
    "stack": [
      "Hardware",
      "Software",
      "AnyDesk",
      "Trello",
      "Gestión de tickets",
      "Soporte on-site",
      "Soporte remoto",
      "Diagnóstico",
      "Instalación de SO"
    ]
  }
]
